src/main/resources/templates/listarProductoNombre.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ns="http://schemas.datacontract.org/2004/07/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:listarProductoNombre>
         <!--Optional:-->
         <tem:ObjProResultado>
            <!--Optional:-->
            <ns:NombreProducto>$!{headers.req.nombreProducto}</ns:NombreProducto>
         </tem:ObjProResultado>
      </tem:listarProductoNombre>
   </soapenv:Body>
</soapenv:Envelope>