target/classes/templates/modificarProducto.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ns="http://schemas.datacontract.org/2004/07/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:modificarProducto>
         <!--Optional:-->
         <tem:value>
           <!--Optional:-->
            <ns:Id>$!{headers.req.id}</ns:Id>
            <!--Optional:-->
            <ns:ciudadEspectaculo>$!{headers.req.ciudadEspectaculo}</ns:ciudadEspectaculo>
            <!--Optional:-->
            <ns:descripcionEspectaculo>$!{headers.req.descripcionEspectaculo}</ns:descripcionEspectaculo>
            <!--Optional:-->
            <ns:espectaculo>$!{headers.req.espectaculo}</ns:espectaculo>
            <!--Optional:-->
            <ns:fechaEspectaculo>$!{headers.req.fechaEspectaculo}</ns:fechaEspectaculo>
            <!--Optional:-->
            <ns:fechaLlegada>$!{headers.req.fechaLlegada}</ns:fechaLlegada>
            <!--Optional:-->
            <ns:fechaSalida>$!{headers.req.fechaSalida}</ns:fechaSalida>
            <!--Optional:-->
            <ns:pathImagen>$!{headers.req.pathImagen}</ns:pathImagen>
            <!--Optional:-->
            <ns:tipoEspectaculo>$!{headers.req.tipoEspectaculo}</ns:tipoEspectaculo>
            <!--Optional:-->
            <ns:tipoHospedaje>$!{headers.req.tipoHospedaje}</ns:tipoHospedaje>
            <!--Optional:-->
            <ns:tipoTransporte>$!{headers.req.tipoTransporte}</ns:tipoTransporte>
         </tem:value>
      </tem:modificarProducto>
   </soapenv:Body>
</soapenv:Envelope>